GopalSaraf/Practicals/PSDL/include/proc/pic18lf45j11.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF45J11_INC_
#define _PIC18LF45J11_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18LF45J11
 */

/*
 * Device Registers
 */

// Register: RPOR0
#define RPOR0 RPOR0
RPOR0                                    equ 0EC6h

// Register: RPOR1
#define RPOR1 RPOR1
RPOR1                                    equ 0EC7h

// Register: RPOR2
#define RPOR2 RPOR2
RPOR2                                    equ 0EC8h

// Register: RPOR3
#define RPOR3 RPOR3
RPOR3                                    equ 0EC9h

// Register: RPOR4
#define RPOR4 RPOR4
RPOR4                                    equ 0ECAh

// Register: RPOR5
#define RPOR5 RPOR5
RPOR5                                    equ 0ECBh

// Register: RPOR6
#define RPOR6 RPOR6
RPOR6                                    equ 0ECCh

// Register: RPOR7
#define RPOR7 RPOR7
RPOR7                                    equ 0ECDh

// Register: RPOR8
#define RPOR8 RPOR8
RPOR8                                    equ 0ECEh

// Register: RPOR9
#define RPOR9 RPOR9
RPOR9                                    equ 0ECFh

// Register: RPOR10
#define RPOR10 RPOR10
RPOR10                                   equ 0ED0h

// Register: RPOR11
#define RPOR11 RPOR11
RPOR11                                   equ 0ED1h

// Register: RPOR12
#define RPOR12 RPOR12
RPOR12                                   equ 0ED2h

// Register: RPOR13
#define RPOR13 RPOR13
RPOR13                                   equ 0ED3h

// Register: RPOR14
#define RPOR14 RPOR14
RPOR14                                   equ 0ED4h
// bitfield definitions
RPOR14_RPOR_POSN                         equ 0000h
RPOR14_RPOR_POSITION                     equ 0000h
RPOR14_RPOR_SIZE                         equ 0005h
RPOR14_RPOR_LENGTH                       equ 0005h
RPOR14_RPOR_MASK                         equ 001Fh

// Register: RPOR15
#define RPOR15 RPOR15
RPOR15                                   equ 0ED5h
// bitfield definitions
RPOR15_RPOR_POSN                         equ 0000h
RPOR15_RPOR_POSITION                     equ 0000h
RPOR15_RPOR_SIZE                         equ 0005h
RPOR15_RPOR_LENGTH                       equ 0005h
RPOR15_RPOR_MASK                         equ 001Fh

// Register: RPOR16
#define RPOR16 RPOR16
RPOR16                                   equ 0ED6h
// bitfield definitions
RPOR16_RPOR_POSN                         equ 0000h
RPOR16_RPOR_POSITION                     equ 0000h
RPOR16_RPOR_SIZE                         equ 0005h
RPOR16_RPOR_LENGTH                       equ 0005h
RPOR16_RPOR_MASK                         equ 001Fh

// Register: RPOR17
#define RPOR17 RPOR17
RPOR17                                   equ 0ED7h

// Register: RPOR18
#define RPOR18 RPOR18
RPOR18                                   equ 0ED8h

// Register: RPOR19
#define RPOR19 RPOR19
RPOR19                                   equ 0ED9h

// Register: RPOR20
#define RPOR20 RPOR20
RPOR20                                   equ 0EDAh

// Register: RPOR21
#define RPOR21 RPOR21
RPOR21                                   equ 0EDBh

// Register: RPOR22
#define RPOR22 RPOR22
RPOR22                                   equ 0EDCh

// Register: RPOR23
#define RPOR23 RPOR23
RPOR23                                   equ 0EDDh

// Register: RPOR24
#define RPOR24 RPOR24
RPOR24                                   equ 0EDEh

// Register: RPINR1
#define RPINR1 RPINR1
RPINR1                                   equ 0EE7h

// Register: RPINR2
#define RPINR2 RPINR2
RPINR2                                   equ 0EE8h

// Register: RPINR3
#define RPINR3 RPINR3
RPINR3                                   equ 0EE9h

// Register: RPINR4
#define RPINR4 RPINR4
RPINR4                                   equ 0EEAh

// Register: RPINR6
#define RPINR6 RPINR6
RPINR6                                   equ 0EECh

// Register: RPINR7
#define RPINR7 RPINR7
RPINR7                                   equ 0EEDh

// Register: RPINR8
#define RPINR8 RPINR8
RPINR8                                   equ 0EEEh

// Register: RPINR12
#define RPINR12 RPINR12
RPINR12                                  equ 0EF2h

// Register: RPINR13
#define RPINR13 RPINR13
RPINR13                                  equ 0EF3h

// Register: RPINR16
#define RPINR16 RPINR16
RPINR16                                  equ 0EF6h

// Register: RPINR17
#define RPINR17 RPINR17
RPINR17                                  equ 0EF7h

